mikee47/HardwareSPI/src/Arch/Esp32/ControllerBase.h
/****
 * ControllerBase.h - Esp32
 *
 * Copyright 2021 mikee47 <mike@sillyhouse.net>
 *
 * This file is part of the HardwareSPI Library
 *
 * This library is free software: you can redistribute it and/or modify it under the terms of the
 * GNU General Public License as published by the Free Software Foundation, version 3 or later.
 *
 * 
 * This library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
 * without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along with this library.
 * If not, see <https://www.gnu.org/licenses/>.
 *
 ****/

#pragma once

#include <memory>
#include <cstdint>
#include <soc/soc_caps.h>

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#include <hal/spi_hal.h>
#pragma GCC diagnostic pop

struct intr_handle_data_t;

namespace HSPI
{
/**
 * @brief Identifies bus selection
 */
enum class SpiBus {
	INVALID = 0,
	MIN = 1,
	SPI1 = 1,
	SPI2 = 2,
	SPI3 = 3,
	MAX = SOC_SPI_PERIPH_NUM,
	DEFAULT = SPI2,
};

struct DeviceConfig {
	uint8_t cs_id;
	bool changed;
	spi_hal_timing_conf_t timing;
	uint32_t requestedSpeed;
};

class ControllerBase
{
public:
	ControllerBase();
	~ControllerBase();

	/**
	 * @brief Get the active ESP32 SPI host identifier
	 */
	uint8_t getHost() const;

protected:
	struct Flags {
		bool initialised : 1;
	};

	void enableSpiInterrupt(bool enable);

	intr_handle_data_t* intr_handle;
	std::unique_ptr<uint32_t[]> dmaBuffer;
	Device* activeDevice{};
	uint8_t deviceCount{0};
	std::bitset<8> chipSelectsInUse; ///< Ensures each CS is used only once
	Flags flags{};
	volatile bool interruptsEnabled{false};
};

} // namespace HSPI
